import React, { Component } from 'react';
import { Image,StyleSheet } from 'react-native';
import { WebView } from 'react-native-webview'
import { Container, Header, Content, Accordion } from 'native-base';
const dataArray = [
  { title: "1. เป็นเบาหวาน ต้องดูแลตัวเองอย่างไร", content: ""
  +"   การที่มีระดับน้ำตาลในเลือดสูงติดต่อกันเป็นระยะเวลานานๆ มีผลให้หลอดเลือดเกิดเสื่อมสภาพ...และกลายเป็นโรคแทรกซ้อนต่างๆ เช่น ไตวาย โรคเส้นเลือดหัวใจตีบ โรคอัมพฤกษ์อัมพาต เป็นต้น โดยมักจะไม่แสดงอาการในระยะแรก ทำให้ยากต่อการรักษาเพื่อให้อวัยวะต่างๆ เหล่านั้นกลับมาทำงานได้เป็นปกติ \n\nดังนั้นผู้ป่วยโรคเบาหวานจึงควรดูแลตัวเองด้วยการ"
  +"\n- ควบคุมระดับน้ำตาลให้อยู่ในเกณฑ์ใกล้เคียงคนปกติ\n"
  +"- ควบคุมความดันโลหิต\n"
  +"- ลดอาหารหวาน มัน เค็ม ลดคาร์โบไฮเดรต เพิ่มผักและผลไม้ที่มีใยอาหาร\n"
  +"- ควบคุมน้ำหนักตัว และ ออกกำลังกายสม่ำเสมอ\n"
  +"- รับประทานยา และ พบแพทย์สม่ำเสมอตามนัด\n"
  +"- คุมระดับไขมันโคเลสเตอรอลให้ได้ตามเกณฑ์\n"
  +"- หยุดสูบบุหรี่\n"
  +"\nเป้าหมายของการควบคุมโรคเบาหวาน\n"
  +"- ความดันโลหิต ต่ำกว่า 135/85 มม.ปรอท\n"
  +"- ระดับคอเลสเตอรอล ชนิด เลว (คือ LDL) ต่ำกว่า 115 มก./ดล.\n"
  +"- ระดับคอเลสเตอรอล ชนิด ดี (คือ HDL) สูงกว่า 46 มก./ดล.\n"
  +"- ระดับไตรกลีเซอไรด์ ต่ำกว่า 150 มก/ดล\n"
  +"- ควบคุมระดับน้ำตาลกลูโคสในเลือด ให้ได้ HbA1c ต่ำกว่า 7%\n "
  +"     "
  +"\nดูแลตัวเองอย่างไร ให้ห่างไกลเบาหวาน\n"
  +"- ออกกำลังกายให้มากขึ้นและสม่ำเสมอ\n"
  +"- หลีกเลี่ยงการใช้พาหนะอำนวยความสะดวก แล้วเดินให้มากขึ้น\n"
  +"- รักษาน้ำหนักตัวให้อยู่ในระดับปกติ ไม่อ้วน ไม่ผอม\n"
  +"- ระวังเรื่องอาหาร โดยเฉพาะอาหารจานด่วนที่มีไขมันสูง\n" },
  { title: "2. เช็คลิสต์! พฤติกรรมเสี่ยงกระดูกพรุน", content: "ใครบ้าง... เสี่ยงกระดูกพรุน\n1. ผู้หญิงที่ฮอร์โมนเพศต่ำ จากการหมดประจำเดือน\n2. คนที่ไม่ได้ขยับหรือเคลื่อนไหวร่างกาย\n3. คนที่ไม่ดื่มนม หรือรับประทานอาหารที่มีแคลเซียมน้อย\n4. คนที่ขาดวิตามินดี ไม่มีโอกาสถูกแสงแดด\n5. คนที่ดื่มแอลกอฮอล์และสูบบหรี่จัด\n6. คนที่ชอบดื่มชา กาแฟ และน้ำอัดลม\n7. คนที่มีรูปร่างผอม ยิ่งผอมมาก ยิ่งเสี่ยงมาก\n8. คนที่อยู่ในภาวะซึมเศร้า\n9. คนที่ได้รับยาบางชนิด\n10. กรรมพันธุ์\n11. คนที่เป็นโรคข้ออักเสบรูมาตอยด์\n12. คนที่เป็นโรคของต่อมไร้ท่อ\n13. คนที่เป็นโรคทางโลหิตวิทยา\n\nหากใครเช็คแล้วมีมากกว่า 1 ข้อ คุณก็คือหนึ่งในกลุ่มเสี่ยงป่วยเป็นโรคกระดูกพรุน ทางที่ดีควรพบแพทย์เพื่อการวินิจฉัย ด้วยการใช้เครื่องเอกซเรย์เพื่อวัดความหนาแน่นของกระดูกได้ เพราะการรู้ตัวว่ากระดูกมีปัญหานั้น จะได้ทำการรักษาและดูแลตัวเองอย่างถูกวิธี ใช้ชีวิตช่วงบั้นปลายอย่างมีความสุข" },
  { title: "3. โรคกระเพาะอาหาร โรคเรื้อรัง มีอันตรายแฝงอยู่", content: "ปัจจัยที่ทำให้เกิดโรคกระเพาะอาหาร"
  +"\n1. เชื้อโรคแบคทีเรีย ชื่อ เฮลิโคแบคเตอร์ ไพโลโร ซึ่งจะติดต่อได้จากการกินอาหาร หรือ ดื่มน้ำที่ไม่สะอาดปนเปื้อนเชื้อโรคเหล่านี้ เชื้อโรคดังกล่าวนี้ ทำให้เกิดแผลกระเพาะอาหารและมะเร็งบางชนิดของกระเพาะอาหารได้"
  +"\n2. ยาแก้ปวดข้อ ปวดกระดูก (Aspirin และ NSAID) ทำให้มีโอกาสเป็นแผลกระเพาะอาหารหรืออักเสบมากขึ้น การหายของแผลช้า)"
  +"\n3. การสูบบุหรี่ ทำให้อัตราการเป็นแผลกระเพาะอาหารเพิ่มขึ้น แผลหายช้า เป็นใหม่ได้ง่าย ทำให้การตอบสนองต่อการรักษาด้วยยาได้ผลไม่ดี"
  +"\n4. เครื่องดื่มแอลกอฮอล์"
  +"\n5. ภาวะเครียด ทานอาหารไม่ตรงเวลาหรือทานรสเผ็ดจัด"
  +"\n6. ติดเชื้อทางเดินอาหาร เช่น ท้องเสีย อาหารเป็นพิษ"
  +"\n7. ยารักษาสิว อาจทำให้เกิดแผลในหลอดอาหาร หรือโรคกระเพาะอาหารได้"
  +"\nอาการเตือน...ถึงเวลาต้องพบแพทย์ทันที (Alarming Symptom)"
  +"\n1. ถ่ายดำหรือถ่ายมีเลือดปน"
  +"\n2. น้ำหนักลด"
  +"\n3. ตัวซีด เหลือง (ดีซ่าน)"
  +"\n4. ปวดรุนแรงนานเป็นชั่วโมง"
  +"\n5. มีอาเจียนรุนแรงติดต่อกัน หรืออาเจียนมีเลือดปน"
  +"\n6. เจ็บหรือกลืนลำบาก"
  +"\n7. มีประวัติครอบครัวป่วยเป็นโรคกระเพาะอาหาร"
  +"\n8. คลำก้อนในท้องได้ หรือต่อมน้ำเหลืองโต"
  +"\nแนวทางการรักษาโรคกระเพาะอาหาร"
  +"\nในผู้ป่วยที่มีอาการปวดจุกแน่นท้อง จุกเสียด ลมเรอ แสบท้อง มานานไม่เกิน 2 สัปดาห์ และไม่มีอาการเตือนที่สำคัญ มีแนวทางรักษา ดังนี้"
  +"\n1. รับประทานยาลดกรดในกระเพาะอาหาร"
  +"\n2. งดบุหรี่ งดเหล้า งดอาหารรสเผ็ด รับประทานอาหารให้ตรงเวลา"
  +"\n3. ออกกำลังกาย"
  +"\n4. งดกินยาแก้ปวดข้อ ปวดกระดูกโดยไม่จำเป็น"
  +"\n\nในกรณีมีแผลในกระเพาะอาหาร อาจต้องวินิจฉัยด้วยวิธีเหล่านี้ก่อน"
  +"\n1. ตัดชิ้นเนื้อจากแผล เพื่อตรวจหาว่าเป็นมะเร็งหรือไม่"
  +"\n2. ตัดชิ้นเนื้อจากส่วนล่างของกระเพาะอาหาร เพื่อดูว่ามีเชื้อโรคเฮลิโคแบคเตอร์ ไพโลไรหรือไม่ ถ้ามีเชื้อโรคดังกล่าวร่วมกับมีแผล ต้องให้ยากำจัดเชื้อโรค 2 สัปดาห์ และให้ยารักษาแผลอีก 4-6 สัปดาห์ หากอาการไม่ดีขึ้นหลังปฎิบัติตามข้างต้น หรืออาการเป็นมานานกว่า 1 เดือน หรือมีอาการเตือนที่สำคัญ ต้องได้รับการวินิจฉัยเพิ่มเติม คือ “การส่องกล้องกระเพาะอาหาร”"
  +"โดยการส่องกล้องตรวจกระเพาะอาหาร นอกจากดูว่ามีแผล เนื้องอก และมะเร็งหรือไม่ ยังสามารถฉีดยาหรือห้ามเลือดด้วยวิธีต่างๆ ผ่านการส่องกล้องตรวจกระเพาะอาหารในผู้ป่วยที่มีเลือดออกจากกระเพาะอาหาร และสามารถติดตามดูการหายของแผลได้" },
  { title: "4. “หมอนรองกระดูก” รักษาได้ไม่ยากอย่างที่คิด", content: "เจ็บหัวเข่า...มีสาเหตุมาจากอะไร"
  +"\n   ซึ่งอาการเจ็บที่หัวเข่านั้นส่วนหนึ่งอาจมีสาเหตุเกิดจากหมอนรองกระดูกข้อเข่า (Meniscus) บาดเจ็บได้ด้วยเช่นกัน อาการบาดเจ็บในจุดนี้มักจะแสดงออกมาชัดเจนในขณะที่เข่ากำลังบิดหมุน รวมถึงการถูกกระแทกหรือลงน้ำหนักในขณะที่เข่างอ โดยลักษณะอาการที่พบบ่อยคือ ปวด บวม ตึง อาการเข่าล็อกหรือเข่าขัดกัน งอเข่าได้ไม่สุด บางรายอาจรู้สึกเหมือนเข่าหลุด"
  +"\n\nการรักษาเป็นอย่างไร"
  +"\n   เบื้องต้นแพทย์จะทำการวินิจฉัยโดยการซักประวัติและตรวจร่างกาย ตลอดจนใช้การเอกซเรย์แม่เหล็กไฟฟ้า (MRI) ซึ่งจะมีความแม่นยำถึง 80 – 90 % ส่วนการวางแนวทางการรักษาของแพทย์นั้นอยู่ภายใต้ปัจจัยที่หลากหลาย หากอาการบาดเจ็บเกิดขึ้นเล็กน้อยหรือรอยฉีกยาวไม่เกิน 1 เซ็นติเมตรและอยู่ในส่วนที่มีเลือดหล่อเลี้ยงซึ่งสามารถหายเองได้ แพทย์จะแนะนำให้พักการเคลื่อนไหว ควบคู่ไปกับการประคบเย็น การรับประทานยา และกายภาพบำบัด แต่หากพบว่าเกิดการบาดเจ็บในระดับรุนแรง การผ่าตัดจะเป็นทางเลือกในการรักษาอาการดังกล่าว โดยเฉพาะการผ่าตัดส่องกล้อง เทคโนโลยีทางการแพทย์ยุคใหม่ที่ลดขั้นตอนและร่นระยะเวลาการรักษาได้มาก สามารถทำได้ทั้งเย็บซ่อมแซมส่วนที่ฉีกขาด หรือตัดเล็มส่วนที่เสียหายออก"
  +"\n\nผ่าตัดส่องกล้อง แผลเล็กเจ็บน้อย\n"
  +"   ซึ่งการผ่าตัดด้วยวิธีส่องกล้องนั้น อาจใช้เวลาพักฟื้นหลังการผ่าตัดที่โรงพยาบาลเพียง 1 – 2 วัน โดยหลังจากนั้นอาจะใช้ไม้เท้าพยุงเดินต่อเนื่องไปอีก 1 – 2 สัปดาห์ ซึ่งหากประกอบอาชีพที่ไม่ต้องเดินหรือเคลื่อนไหวมากนัก คนไข้สามารถกลับไปทำงานได้ทันที พร้อม ๆ กับการทำกายภาพบำบัดตามท่วงท่าที่แพทย์แนะนำซึ่งคนไข้นั้นสามารถทำได้ที่บ้านด้วยตัวเอง"}
];
export default class Medicalknowledge extends Component {
  render() {
    return (
      <Container>
      <Content padder>
        <Accordion dataArray={dataArray} icon="add" expandedIcon="remove" />
      </Content>
    </Container>
    );
  }
}
const styles = StyleSheet.create({
    cardbox: {
      marginLeft:"2%",
      width:"96%",
      height : 295,
  }
})